# kompege 6847
'''
'''
# 3210   3210    
# x321 + 17x4
for x in range(110, -1, -1): # Наибольшее значение x --> идём от больших к меньшим
    num1 = 1 * 111**0 + 2 * 111**1 + 3 * 111**2 + x * 111**3
    num2 = 4 * 211**0 + x * 211**1 + 7 * 211**2 + 1 * 211**3
    res = num1 + num2

    if res % 111 == 0:
        print(res // 111) # 297262
        break

# kompege 6846
'''
'''
for x in range(97, -1, -1):
    # 98 C.C.
    # 43210
    # 12x45
    num1 = 5 * 98**0 + 4 * 98**1 + x * 98**2 + 2 * 98**3 + 1 *98**4
    # 123 C.C.
    # 3210
    # 1x98
    num2 = 8 * 123**0 + 9 * 123**1 + x * 123**2 + 1 * 123**3
    res = num1 + num2

    if res % 123 == 0:
        print(res // 123) # 792604
        break

# kompege 6788
'''
'''
# В цикле перебирать на 1 меньше (c 67), чем С.С., т.к. 0 учитывается
# Чтобы не мучиться с правильной установкой range() можно идти по возрастанию и не ставить break
# Брать в ответ последний результат
for x in range(67, -1, -1):
    # 43210
    # 123x5(68)
    # 43210
    # 1x233(68)

    num1 = 5 * 68**0 + x * 68**1 + 3 * 68**2 + 2 * 68**3 + 1 * 68**4
    num2 = 3 * 68**0 + 3 * 68**1 + 2 * 68**2 + x * 68**3 + 1 * 68**4
    res = num1 + num2

    if res % 12 == 0:
        print(res // 12) # 5321454
        break


