# Решение типа 15 КОДОМ

# 1223
#Наименьшая длина
'''
B=list(range(25,41))
C=list(range(12,34))
A=[]
for x in range(1,100):
    if (((x in B) <= (x in A)) and ((not(x in C)) or (x in A)))==0:
        A.append(x)
print(A) # 40-12 = 28
'''

# 2184
#Наибольшая длина
'''
P=list(range(1,40))
Q=list(range(23,59))
A=list(range(-100,100))
for x in range(-100,100):
    if (((x in P) <=(not(x in Q))) <= (not(x in A)))==0:
        A.remove(x)
print(A) # Ответ 39-23 = 16
'''


# егкр вар 1 номер 15
# Наим. длина А
'''
P=list(range(24,91))
Q=list(range(47,116))
A=[]
for x in range(-10,150):
    if ( (x in Q) <= (( (x in P) and (not (x in A)) ) <= (not (x in Q))) )==0: # == 0 - противоположное
        A.append(x)
print(A) # 90-47=43
'''

# Верный 43

# kompege 2861
'''
На числовой прямой даны два отрезка: P = [69; 91] и Q = [77; 114].
Укажите наименьшую возможную длину такого отрезка A, для которого формула (x ∊ Q) → (((x ∊ P) ≡ (x ∊ Q)) ∨ (¬(x ∊ P) → (x ∊ A)))
тождественно истинна (т. е. принимает значение 1 при любом значении переменной х).
'''

"""
P = list(range(69, 92)) 
Q = list(range(77, 115))
A = []

for x in range(-10, 150):
    if ( (x in Q) <= (((x in P) == (x in Q)) or ((not(x in P)) <= (x in A))) ) == 0:
        A.append(x)
        # Сравнивать выданные значения с диапозонами ИЗ УСЛОВИЯ!
        # P = [69; 91] и Q = [77; 114].

        # 92 в условии нет. Расширяем список на 1 влево
        # 114 в условии есть. Не расширяем список вправо

print(A)
print(114-91) # 23
"""
