# Задание 25 в ЕГЭ
'''
n = int(input()) # Принимаем число
k = 0 # кол. делителей

for i in range(1, n):
    if n % i == 0:
        k = k + 1

n = int(input())
k = 0
for i in range(1, n):
    if n % i == 0:
        k = k + 1

print(k)
'''

# 
